GREETING = "Привет! Я бот помошник, который предназначен облегчить тебе процесс выбора продуктов для массанабора/сушки💪"

DATA_SAVED = "Ваши данные сохранены!Теперь, вы можете составить список продуктов."

SPRAVKA_TEXT = (
    'Данное меню поможет составить дневной список продуктов для вашего рациона, '
    'нажмите на кнопку "Составить список продукто", затем введите желаемый дневной бюджет, '
    'и готово! Получите список продуктов на день, с характеристиками цены, бжу, ккал, '
    'и информацией в каком магазине этот продукт можно купить! '
)

BUDGET_PROMPT = "Введите желаемый дневной бюджет на продукты"
BUDGET_SAVED = "Ваш дневной бюджет сохранен!"
INVALID_NUMBER = "Введите корректное число!"
INVALID_NUMBER_EXCLAMATION = "Введите корректное число"
SELECT_POSITIONS = "Выберите позиции:"
SELECT_AGAIN = "Выберите позиции заново:"
ALL_SELECTED = "\nВсе позиции выбраны. Что дальше?"
YOU_SELECTED = "Вы выбрали:\n"

HARRIS_INTRO = "Выбран рассчет по Методу Харрис-Бенедикта, основанный на расчета базального и активного метобализма"
MIFFLIN_INTRO = "Выбран расчет по методу Маффина, который был разработан в 2005 г"

HARRIS_RESULT = (
    "Ваш результат по методу Харриса-Бенедикта: {kcal} Ккал\n\n"
    "Ваша норма БЖУ: \n"
    "Белки: {protein} г\n"
    "Жиры: {fat} г\n"
    "Углеводы: {carbs}г"
)

MIFFLIN_RESULT = (
    "Ваш результат по методу Маффина: {kcal} Ккал\n\n"
    "Ваша норма БЖУ: \n"
    "Белки: {protein} г\n"
    "Жиры: {fat} г\n"
    "Углеводы: {carbs}г"
)

MANUAL_RESULT = (
    "Ваш каллораж: {kcal} Ккал\n\n"
    "Ваша норма БЖУ: \n"
    "Белки: {protein} г\n"
    "Жиры: {fat} г\n"
    "Углеводы: {carbs}г"
)

DATA_DISPLAY = (
    "Ваш каллораж: {kcal}  Ккал\n"
    "Белки:{protein} г\n"
    "Жиры:{fat} г\n"
    "Угеводы:{carbs} г"
)

WEIGHT_PROMPT = "Введите свой вес"
HEIGHT_PROMPT = "Введите свой рост"
AGE_PROMPT = "Введите свой возраст"
ACTIVITY_PROMPT = "Выберете уровень активности"
SEX_PROMPT = "Выберете пол"
GOAL_PROMPT = "Выберите цель"

PROTEIN_PROMPT = "Введите норму белков"
FAT_PROMPT = "Введите норму жиров"
CARB_PROMPT = "Введите норму углеводов"
